using System.Collections.Generic;

namespace AspNetApp.Randomizer.Model
{
	public partial class CandidateData
	{
		public static List<string> MaleNames { get; private set; } = new List<string>
		{
			"Александр",
			"Дмитрий",
			"Максим",
			"Сергей",
			"Андрей",
			"Алексей",
			"Артём",
			"Илья",
			"Кирилл",
			"Михаил",
			"Никита",
			"Матвей",
			"Роман",
			"Егор",
			"Арсений",
			"Иван",
			"Денис",
			"Евгений",
			"Даниил",
			"Тимофей",
			"Владислав",
			"Игорь",
			"Владимир",
			"Павел",
			"Руслан",
		};

		public static List<string> Surnames { get; private set; } = new List<string>
		{
			"Смирнов",
			"Иванов",
			"Кузнецов",
			"Соколов",
			"Попов",
			"Лебедев",
			"Козлов",
			"Новиков",
			"Морозов",
			"Петров",
			"Волков",
			"Соловьёв",
			"Васильев",
			"Зайцев",
			"Павлов",
			"Семёнов",
			"Голубев",
			"Виноградов",
			"Богданов",
			"Воробьёв",
			"Фёдоров",
			"Михайлов",
			"Беляев",
			"Тарасов",
			"Белов",
		};

		public static List<string> MalePatronymics { get; private set; } = new List<string>
		{
			"Алексанрович",
			"Дмитриевич",
			"Максимович",
			"Сергеевич",
			"Андреевич",
			"Алексеевич",
			"Артёмович",
			"Ильич",
			"Кириллович",
			"Михаилович",
			"Никитич",
			"Матвеевич",
			"Романович",
			"Егорович",
			"Арсеньевич",
			"Иванович",
			"Денисович",
			"Евгеньевич",
			"Данилович",
			"Тимофеевич",
			"Владиславович",
			"Игоревич",
			"Владимирович",
			"Павлович",
			"Русланович",
		};
	}
}